# Initial HESA HE Enrolment Data Review

In [1]:
import pandas as pd

## HE enrolment by Subject

In [3]:
enrol_sub_df = pd.read_csv("HE enrolment by Subject.csv")
enrol_sub_df.head()

,CAH level marker,CAH level subject,Level of study,Mode of study,Academic Year,Category marker,Category,Number
0,CAH level 1,01 Medicine and dentistry,All,Full-time,2020/21,Sex,Female,39790
1,CAH level 1,01 Medicine and dentistry,All,Full-time,2020/21,Sex,Male,24740
2,CAH level 1,01 Medicine and dentistry,All,Full-time,2020/21,Sex,Other,110
3,CAH level 1,01 Medicine and dentistry,All,Full-time,2020/21,Domicile,Not known,0
4,CAH level 1,01 Medicine and dentistry,All,Full-time,2020/21,Domicile,England,43530

In [4]:
enrol_sub_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119175 entries, 0 to 119174
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   CAH level marker   119175 non-null  object
 1   CAH level subject  119175 non-null  object
 2   Level of study     119175 non-null  object
 3   Mode of study      119175 non-null  object
 4   Academic Year      119175 non-null  object
 5   Category marker    119175 non-null  object
 6   Category           119175 non-null  object
 7   Number             119175 non-null  int64
dtypes: int64(1), object(7)
memory usage: 7.3+ MB

The dataset contains 119175 rows and 8 columns. There is one column with a data type of integer and the remaining columns are objects. An index column has been created for the dataframe. There are no nulls in the dataset.

In [5]:
enrol_sub_df.describe()

             Number
count  1.191750e+05
mean   6.384784e+03
std    5.914515e+04
min    0.000000e+00
25%    0.000000e+00
50%    5.500000e+01
75%    6.750000e+02
max    2.751865e+06

Summary statistcs for the number column for enrolment data.

**CAH level marker**

CAH is the Common Aggregation Hierarchy used to code subjects.

In [7]:
enrol_sub_df["CAH level marker"].describe()

count          119175
unique              2
top       CAH level 3
freq           103425
Name: CAH level marker, dtype: object

The data in this column has 2 unique values and the data type is object.

In [8]:
enrol_sub_df["CAH level marker"].unique()

array(['CAH level 1', 'CAH level 3'], dtype=object)

CAH Level 1 is the high level subject e.g. CAH01 medicine and dentistry and CAH Level 3 is the detailed subject e.g. CAH01-01-01 is medical sciences (non-specific). This may not be relevant to include in our analysis as we want to look at detailed subject level to investigate what women are studying.

In [11]:
# look at removing/dropiint CAH level marker

**CAH level subject**

In [9]:
enrol_sub_df["CAH level subject"].describe()

count     119175
unique       193
top        Total
freq        1260
Name: CAH level subject, dtype: object

The data in this column has 193 unique values and the data type is object.

In [10]:
enrol_sub_df["CAH level subject"].unique()

array(['01 Medicine and dentistry', '02 Subjects allied to medicine',
       '03 Biological and sport sciences', '04 Psychology',
       '05 Veterinary sciences',
       '06 Agriculture, food and related studies', '07 Physical sciences',
       '09 Mathematical sciences', '10 Engineering and technology',
       '11 Computing', '13 Architecture, building and planning',
       '26 Geography, earth and environmental studies (natural sciences)',
       'Total science CAH level 1', '15 Social sciences', '16 Law',
       '17 Business and management',
       '24 Media, journalism and communications',
       '19 Language and area studies',
       '20 Historical, philosophical and religious studies',
       '25 Design, and creative and performing arts',
       '22 Education and teaching', '23 Combined and general studies',
       '26 Geography, earth and environmental studies (social sciences)',
       'Total non-science CAH level 1', 'Total',
       '01-01-01 Medical sciences (non-specific)',
       '01-01-02 Medicine (non-specific)',
       '01-01-03 Medicine by specialism', '01-01-04 Dentistry',
       '02-02-01 Pharmacology', '02-02-02 Toxicology',
       '02-02-03 Pharmacy', '02-04-01 Nursing (non-specific)',
       '02-04-02 Adult nursing', '02-04-03 Community nursing',
       '02-04-04 Midwifery', "02-04-05 Children's nursing",
       '02-04-06 Dental nursing', '02-04-07 Mental health nursing',
       '02-04-08 Learning disabilities nursing',
       '02-04-09 Others in nursing', '02-05-01 Medical technology',
       '02-05-02 Healthcare science (non-specific)',
       '02-05-03 Biomedical sciences (non-specific)',
       '02-05-04 Anatomy, physiology and pathology',
       '02-06-01 Health sciences (non-specific)',
       '02-06-02 Nutrition and dietetics', '02-06-03 Ophthalmics',
       '02-06-04 Environmental and public health',
       '02-06-05 Physiotherapy',
       '02-06-06 Complementary and alternative medicine',
       '02-06-07 Counselling, psychotherapy and occupational therapy',
       '03-01-01 Biosciences (non-specific)',
       '03-01-02 Biology (non-specific)',
       '03-01-03 Ecology and environmental biology',
       '03-01-04 Microbiology and cell science',
       '03-01-05 Plant sciences', '03-01-06 Zoology', '03-01-07 Genetics',
       '03-01-08 Molecular biology, biophysics and biochemistry',
       '03-01-09 Hair and beauty sciences',
       '03-01-10 Others in biosciences',
       '03-02-01 Sport and exercise sciences',
       '04-01-01 Psychology (non-specific)',
       '04-01-02 Applied psychology', '04-01-03 Developmental psychology',
       '04-01-04 Psychology and health', '04-01-05 Others in psychology',
       '05-01-01 Veterinary medicine and dentistry',
       '05-01-02 Others in veterinary sciences',
       '06-01-01 Animal science', '06-01-02 Agricultural sciences',
       '06-01-03 Agriculture', '06-01-04 Rural estate management',
       '06-01-05 Forestry and arboriculture',
       '06-01-06 Food and beverage studies (non-specific)',
       '06-01-07 Food sciences', '06-01-08 Food and beverage production',
       '07-01-01 Physics', '07-01-02 Astronomy', '07-02-01 Chemistry',
       '07-04-01 Physical sciences (non-specific)',
       '07-04-02 Forensic and archaeological sciences',
       '07-04-03 Sciences (non-specific)',
       '07-04-04 Natural sciences (non-specific)', '09-01-01 Mathematics',
       '09-01-02 Operational research', '09-01-03 Statistics',
       '10-01-01 Engineering (non-specific)',
       '10-01-02 Mechanical engineering',
       '10-01-03 Production and manufacturing engineering',
       '10-01-04 Aeronautical and aerospace engineering',
       '10-01-05 Naval architecture',
       '10-01-06 Bioengineering, medical and biomedical engineering',
       '10-01-07 Civil engineering',
       '10-01-08 Electrical and electronic engineering',
       '10-01-09 Chemical, process and energy engineering',
       '10-01-10 Others in engineering', '10-03-01 Minerals technology',
       '10-03-02 Materials technology', '10-03-03 Polymers and textiles',
       '10-03-04 Maritime technology', '10-03-05 Biotechnology',
       '10-03-06 Others in technology', '10-03-07 Materials science',
       '11-01-01 Computer science', '11-01-02 Information technology',
       '11-01-03 Information systems', '11-01-04 Software engineering',
       '11-01-05 Artificial intelligence',
       '11-01-06 Computer games and animation',
       '11-01-07 Business computing', '11-01-08 Others in computing',
       '13-01-01 Architecture', '13-01-02 Building',
       '13-01-03 Landscape design',
       '13-01-04 Planning (urban, rural and regional)',
       '26-01-01 Geography (non-specific)',
       '26-01-02 Physical geographical sciences',
       '26-01-04 Environmental sciences',
       '26-01-05 Others in geographical studies',
       '26-01-06 Earth sciences', 'Total science CAH level 3',
       '15-01-01 Social sciences (non-specific)', '15-01-02 Sociology',
       '15-01-03 Social policy', '15-01-04 Anthropology',
       '15-01-05 Development studies', '15-01-06 Cultural studies',
       '15-02-01 Economics', '15-03-01 Politics', '15-04-01 Social work',
       '15-04-02 Childhood and youth studies', '15-04-03 Health studies',
       '16-01-01 Law', '17-01-01 Business and management (non-specific)',
       '17-01-02 Business studies', '17-01-03 Marketing',
       '17-01-04 Management studies',
       '17-01-05 Human resource management',
       '17-01-06 Tourism, transport and travel', '17-01-07 Finance',
       '17-01-08 Accounting',
       '17-01-09 Others in business and management',
       '19-01-01 English studies (non-specific)',
       '19-01-02 English language', '19-01-03 Literature in English',
       '19-01-04 Studies of specific authors',
       '19-01-05 Creative writing', '19-01-06 Others in English studies',
       '19-01-07 Linguistics', '19-02-01 Celtic studies (non-specific)',
       '19-02-02 Gaelic studies', '19-02-03 Welsh studies',
       '19-02-04 Others in Celtic studies', '19-04-01 French studies',
       '19-04-02 German and Scandinavian studies',
       '19-04-03 Italian studies', '19-04-04 Iberian studies',
       '19-04-05 Slavic studies', '19-04-06 Asian studies',
       '19-04-07 African and modern Middle Eastern studies',
       '19-04-08 American and Australasian studies',
       '19-04-09 Others in language and area studies', '20-01-01 History',
       '20-01-02 History of art, architecture and design',
       '20-01-03 Archaeology', '20-01-04 Heritage studies',
       '20-01-05 Classics', '20-02-01 Philosophy',
       '20-02-02 Theology and religious studies', '22-01-01 Education',
       '22-01-02 Teacher training',
       '23-01-01 Combined, general or negotiated studies',
       '23-01-02 Personal development',
       '23-01-03 Humanities (non-specific)',
       '23-01-04 Liberal arts (non-specific)',
       '24-01-01 Information services', '24-01-02 Publicity studies',
       '24-01-03 Publishing', '24-01-04 Journalism',
       '24-01-05 Media studies',
       '25-01-01 Creative arts and design (non-specific)', '25-01-02 Art',
       '25-01-03 Design studies', '25-01-04 Cinematics and photography',
       '25-01-05 Others in creative arts and design',
       '25-02-01 Performing arts (non-specific)', '25-02-02 Music',
       '25-02-03 Drama', '25-02-04 Dance', '26-01-03 Human geography',
       'Total non-science CAH level 3'], dtype=object)

**Level of study**

In [12]:
enrol_sub_df["Level of study"].describe()

count     119175
unique         7
top          All
freq       17400
Name: Level of study, dtype: object

The data in this column has 7 unique values and the data type is object.

In [13]:
enrol_sub_df["Level of study"].unique()

array(['All', 'Postgraduate (research)', 'Postgraduate (taught)',
       'All postgraduate', 'First degree', 'Other undergraduate',
       'All undergraduate'], dtype=object)

Looking at the values in this column, it would be interesting to see the number and proportion of females studying different subjects at different levels.

To get the breakdown, we will remove rows with a value of 'All'. We will need to begin analysing the data to review the merits of retaining the 'All undergraduate' and 'All postgraduate' values.

Postgraduate combines all postgraduate taught and postgraduate research students, whereas I think we would be better splitting these out.

'All undergraduate' contains first degrees and other degrees - we may not want to include other degrees in our analysis as it is a broad category where we cannot specify the degree achieved as an outcome.

We will need to be consistent with the approach to the Student data analysis.

In [14]:
# look to remove rows with a value of 'All'

**Mode of study**

In [15]:
enrol_sub_df["Mode of study"].describe()

count     119175
unique         3
top          All
freq       40140
Name: Mode of study, dtype: object

The data in this column has 3 unique values and the data type is object.

In [16]:
enrol_sub_df["Mode of study"].unique()

array(['Full-time', 'Part-time', 'All'], dtype=object)

This column contains information on whether students are studying full or part-time. Here I think it will be useful to retain all values initially. We might want to use all to get the general trends but can then look at full-time and part-time split by gender to see which subjects females are studying full or part-time.

**Academic Year**

In [17]:
enrol_sub_df["Academic Year"].describe()

count      119175
unique          2
top       2019/20
freq        59670
Name: Academic Year, dtype: object

The data in this column has 2 unique values and the data type is object.

In [18]:
enrol_sub_df["Academic Year"].unique()

array(['2020/21', '2019/20'], dtype=object)

We only have two years worth of data - 2019/20 and 2020/21 which is insufficient to undertake a time series analysis. The reason for this is that there was a change to subject coding which was implemented ahead of 2019/0. Previous data is not suitable for comparison. It will still be interesting to discover what subjects women are studying and this is something that can then be further investigated in the future as more data becomes available.

**Category marker**

In [19]:
enrol_sub_df["Category marker"].describe()

count       119175
unique           4
top       Domicile
freq         79450
Name: Category marker, dtype: object

The data in this column has 4 unique values and the data type is object.

In [20]:
enrol_sub_df["Category marker"].unique()

array(['Sex', 'Domicile', 'Error', 'Total'], dtype=object)

An immediate flag on this dataset is the inclusion of 'Error' as a value. The reason behind this value will need to be investigated to see what could be included in this grouping. Our project is focusing on gender, so we will retain only rows where the value is sex. We will need to confirm if a value for sex is available for all rows in the dataset.

In [21]:
# look to remove rows where the value is not equal to sex.

**Category**

In [22]:
enrol_sub_df["Category"].describe()

count     119175
unique        15
top       Female
freq        7945
Name: Category, dtype: object

The data in this column has 15 unique values and the data type is object.

In [23]:
enrol_sub_df["Category"].unique()

array(['Female', 'Male', 'Other', 'Not known', 'England', 'Wales',
       'Scotland', 'Northern Ireland', 'Other UK', 'Total UK',
       'European Union', 'Non-European Union', 'Total Non-UK',
       'Not known ', 'Total'], dtype=object)

We can see from the values in the above array that those which map to the category marker 'Sex' are 'Female', 'Male' and 'Other'. There are no error values in this column but we will need to check the category column against the category marker column to check for inconsistencies. 

We will retain only the 'Sex' values for our analysis.

In [24]:
# look to remove rows where the value is not a gender value

## HE students by CAH level 1 and sex

In [25]:
enrol_CAH1_df = pd.read_csv("HE students by CAH level 1 and sex.csv")
enrol_CAH1_df.head()

                      CAH level 1     Sex Academic Year  Number
0       01 Medicine and dentistry  Female       2019/20   42610
1       01 Medicine and dentistry    Male       2019/20   27605
2       01 Medicine and dentistry  Female       2020/21   47435
3       01 Medicine and dentistry    Male       2020/21   29445
4  02 Subjects allied to medicine  Female       2019/20  233810

In [27]:
enrol_CAH1_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CAH level 1    88 non-null     object
 1   Sex            88 non-null     object
 2   Academic Year  88 non-null     object
 3   Number         88 non-null     int64
dtypes: int64(1), object(3)
memory usage: 2.9+ KB

There are 88 rows and 4 columns in the data set, which includes data on the level 1 CAH grouping and sex. One column has a data tyoe if number and the remaining columns are objects.

In [26]:
enrol_CAH1_df.describe()

              Number
count      88.000000
mean    59941.193182
std     61212.355741
min      1945.000000
25%     21277.500000
50%     36875.000000
75%     71757.500000
max    269305.000000

Summary statistics for the number column

**CAH level 1**

In [28]:
enrol_CAH1_df["CAH level 1"].describe()

count                            88
unique                           22
top       01 Medicine and dentistry
freq                              4
Name: CAH level 1, dtype: object

The data in this column has 22 unique values and the data type is object.

In [29]:
enrol_CAH1_df["CAH level 1"].unique()

array(['01 Medicine and dentistry', '02 Subjects allied to medicine',
       '03 Biological and sport sciences', '04 Psychology',
       '05 Veterinary sciences',
       '06 Agriculture, food and related studies', '07 Physical sciences',
       '09 Mathematical sciences', '10 Engineering and technology',
       '11 Computing', '13 Architecture, building and planning',
       '26 Geography, earth and environmental studies (natural sciences)',
       '15 Social sciences', '16 Law', '17 Business and management',
       '19 Language and area studies',
       '20 Historical, philosophical and religious studies',
       '22 Education and teaching', '23 Combined and general studies',
       '24 Media, journalism and communications',
       '25 Design, and creative and performing arts',
       '26 Geography, earth and environmental studies (social sciences)'],
      dtype=object)

This is the level 1 CAH grouping for subject. We will include all values here as we wish to investigate the subjects being studied by women.

**Sex**

In [30]:
enrol_CAH1_df["Sex"].describe()

count         88
unique         2
top       Female
freq          44
Name: Sex, dtype: object

The data in this column has 2 unique values and the data type is object.

In [31]:
enrol_CAH1_df["Sex"].unique()

array(['Female', 'Male'], dtype=object)

There are only two values recorded for sex- male and female. We will need to be aware that our student and graduate datasets have the additional value of 'other' when undertaking our analysis.

**Academic Year**

In [32]:
enrol_CAH1_df["Academic Year"].describe()

count          88
unique          2
top       2019/20
freq           44
Name: Academic Year, dtype: object

The data in this column has 2 unique values and the data type is object.

In [33]:
enrol_CAH1_df["Academic Year"].unique()

array(['2019/20', '2020/21'], dtype=object)

There are only two academic years worth of data for us to analyse due to the changes in subject coding introduced ahead of 2019/20. Whilst this is insufficient to undertake a time series analysis, it will be interesting to see which subjects are being studied by women in each year. This also something that can be investigated further as more data becomes available.

## Percentage of HE Student Enrolments in  Science Subjects by Personal Characteristics

In [34]:
enrol_science_df = pd.read_csv("Percentage of HE student enrolments in science subjects by personal characteristics.csv")
enrol_science_df.head()

,Category Marker,Category,First year marker,Level of study,Mode of study,Country of HE provider,Academic Year,Percentage
0,Sex,Female,All,All,All,All,2019/20,41%
1,Sex,Female,All,All,All,All,2020/21,42%
2,Sex,Female,All,All,All,England,2019/20,40%
3,Sex,Female,All,All,All,England,2020/21,41%
4,Sex,Female,All,All,All,Northern Ireland,2019/20,51%

In [35]:
enrol_science_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7232 entries, 0 to 7231
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Category Marker         7232 non-null   object
 1   Category                7232 non-null   object
 2   First year marker       7232 non-null   object
 3   Level of study          7232 non-null   object
 4   Mode of study           7232 non-null   object
 5   Country of HE provider  7232 non-null   object
 6   Academic Year           7232 non-null   object
 7   Percentage              6824 non-null   object
dtypes: object(8)
memory usage: 452.1+ KB

There are 7232 rows and 8 columns in the dataset. All columns contain object data type. It looks as though there are nulls in the percentage column.

In [36]:
enrol_science_df.describe()

,Category Marker,Category,First year marker,Level of study,Mode of study,Country of HE provider,Academic Year,Percentage
count,7232,7232,7232,7232,7232,7232,7232,6824
unique,7,26,3,3,3,5,2,89
top,Religious Belief,Other,All,All,All,All,2019/20,44%
freq,2430,534,2418,2418,2420,1458,3616,426

Summary statistics for science enrolments

**Category Marker**

In [38]:
enrol_science_df["Category Marker"].describe()

count                 7232
unique                   7
top       Religious Belief
freq                  2430
Name: Category Marker, dtype: object

The data in this column has 7 unique values and the data type is object.

In [39]:
enrol_science_df["Category Marker"].unique()

array(['Sex', 'Age Group', 'Disability Status', 'Religious Belief',
       'Ethnicity', 'Total UK domiciled students', 'Total'], dtype=object)

As our project focuses on gender, we will only retain rows where the value is 'Sex'.

In [40]:
# remove rows where the value is not equal to sex.

**Category**

In [41]:
enrol_science_df["Category"].describe()

count      7232
unique       26
top       Other
freq        534
Name: Category, dtype: object

The data in this column has 26 unique values and the data type is object.

In [42]:
enrol_science_df["Category"].unique()

array(['Female', 'Male', 'Other', '20 and under', '21-24 years',
       '25-29 years', '30 years and over', 'Age unknown',
       'Known disability', 'No known disability', 'No religion',
       'Buddhist', 'Christian', 'Hindu', 'Jewish', 'Muslim', 'Sikh',
       'Spiritual', 'Any other religion or belief', 'White', 'Black',
       'Asian', 'Mixed', 'Not known', 'Total UK domiciled students',
       'Total'], dtype=object)

As we are investigating gender, we will only retain the values of female, male and other.

In [43]:
# remove rows where the value is not a gender value.

**First year marker**

In [44]:
enrol_science_df["First year marker"].describe()

count     7232
unique       3
top        All
freq      2418
Name: First year marker, dtype: object

The data in this column has 3 unique values and the data type is object.

In [45]:
enrol_science_df["First year marker"].unique()

array(['All', 'First year', 'Other years'], dtype=object)

First year marker is whether a student is in their first year of study for their degree or other years. For higher education data in our project, we are looking at first year students and then graduates to get an idea of completion, i.e. who starts vs who finishes.

In the First year marker column, we only want to retain the value of 'First year'. We will want to drop rows with the 'All' and 'Other years' values.

In [48]:
# remove rows where the value is not equal to first year.

**Level of study**

In [46]:
enrol_science_df["Level of study"].describe()

count     7232
unique       3
top        All
freq      2418
Name: Level of study, dtype: object

The data in this column has 3 unique values and the data type is object.

In [47]:
enrol_science_df["Level of study"].unique()

array(['All', 'Postgraduate', 'Undergraduate'], dtype=object)

Looking at the values in this column, it would be interesting to see the number and proportion of females starting different levels of degree.

To get the breakdown, we will remove rows with a value of 'All'.

In [49]:
# look to remove rows where the value is all.

**Mode of study**

In [50]:
enrol_science_df["Mode of study"].describe()

count     7232
unique       3
top        All
freq      2420
Name: Mode of study, dtype: object

The data in this column has 3 unique values and the data type is object.

In [51]:
enrol_science_df["Mode of study"].unique()

array(['All', 'Full-time', 'Part-time'], dtype=object)

This column contains information on whether students are studying full or part-time. Here I think it will be useful to retain all values initially. We might want to use all to get the general trends but can then look at full-time and part-time split by gender to see if women are more or less likely to study full-time than males.

**Country of HE provider**

In [52]:
enrol_science_df["Country of HE provider"].describe()

count     7232
unique       5
top        All
freq      1458
Name: Country of HE provider, dtype: object

The data in this column has 5 unique values and the data type is object.

In [53]:
enrol_science_df["Country of HE provider"].unique()

array(['All', 'England', 'Northern Ireland', 'Scotland', 'Wales'],
      dtype=object)

Data is available for the four devolved nations. As the secondary level education data we have is only available for England, we should only retain rows with a value of England for our project.

In [54]:
# look to remove rows where value is not equal to England.

**Academic Year**

In [55]:
enrol_science_df["Academic Year"].describe()

count        7232
unique          2
top       2019/20
freq         3616
Name: Academic Year, dtype: object

The data in this column has 2 unique values and the data type is object.

In [56]:
enrol_science_df["Academic Year"].unique()

array(['2019/20', '2020/21'], dtype=object)

There are only two academic years worth of data for us to analyse due to the changes in subject coding introduced ahead of 2019/20. Whilst this is insufficient to undertake a time series analysis, it will be interesting to see which science subjects are being studied by women in each year. This also something that can be investigated further as more data becomes available.